Catalogs/Предметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Предметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Экипировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭкипировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХарактеристикиЭкипировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиЭкипировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметЭкипировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыХарактеристикПредметов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Предметы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЭкипировкаПриИзменении(Элемент)
	Элементы.ТипПредмета.Видимость = Объект.Экипировка;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ЗначенияПоУмолчанию = Новый Структура;
	Если Объект.Экипировка тогда
		ЗначенияПоУмолчанию.Вставить("Сила", 0);
		ЗначенияПоУмолчанию.Вставить("Ловкость", 0);
	    ЗначенияПоУмолчанию.Вставить("Выносливость", 0);
	    ЗначенияПоУмолчанию.Вставить("Интелект", 0);
	    ЗначенияПоУмолчанию.Вставить("ЗащитаВЕдиницах", 0);
	    ЗначенияПоУмолчанию.Вставить("ЗащитаВПроцентах", 0);
	    ЗначенияПоУмолчанию.Вставить("ШансУворота", 0);
	    ЗначенияПоУмолчанию.Вставить("МаксСтамина", 0);
	    ЗначенияПоУмолчанию.Вставить("МаксМана", 0);
	    ЗначенияПоУмолчанию.Вставить("ФизическийУрон", 0);
	    ЗначенияПоУмолчанию.Вставить("МагическийУрон", 0);
	    ЗначенияПоУмолчанию.Вставить("ПробивнойУрон", 0);
		ЗначенияПоУмолчанию.Вставить("МаксЗдоровье", 0);
		ЗначенияПоУмолчанию.Вставить("Здоровье", 0);
		ЗначенияПоУмолчанию.Вставить("Мана", 0);
	    ЗначенияПоУмолчанию.Вставить("Стамина", 0);
	КонецЕсли;
	
	предмет = Справочники.Предметы.НайтиПоНаименованию(Объект.Наименование);
	
	НаборЗаписей = РегистрыСведений.ХарактеристикиЭкипировки.СоздатьНаборЗаписей();
	Для каждого элемента из ЗначенияПоУмолчанию Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПредметЭкипировки = предмет.Ссылка;
		НоваяЗапись.Характеристика = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(элемента.Ключ);               
		НоваяЗапись.Значение = элемента.Значение;
	КонецЦикла; 
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипПредмета.Видимость = Объект.Экипировка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
